In [ ]:
#### Pandas is a powerful library in data science,where we can convert raw data to understandable information. It is built on top of numpy,and contains more functionalities than numpy. It is best tool for handling real world messy data.

* Pandas gives us 2 powerful data structures-series,dataframe. Internal alignment of data is a specific feature of this tool

In [1]:
import numpy as np
import pandas as pd

In [2]:
d=[40,20,60,80,12]
ser1=pd.Series(d)
print(ser1)
print(type(ser1))

0    40
1    20
2    60
3    80
4    12
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
###we can give our own indexes:
sales=[500,550,675,486,682]
days=['Monday','Tuesday','Wednesday','Thursday','Friday']

ser2=pd.Series(sales,index=days)
ser2

Monday       500
Tuesday      550
Wednesday    675
Thursday     486
Friday       682
dtype: int64

In [4]:
###Q) What are the sales recorded on thurday?

thurs_sales=ser2['Thursday']
print('Sales on Thursday:',thurs_sales)

Sales on Thursday: 486

In [6]:
sales2=np.array([500,550,675,486,682]) ###create a series from values stored in an array
ser3=pd.Series(sales2)
ser3

0    500
1    550
2    675
3    486
4    682
dtype: int32

In [7]:
###using data stored in a dictionaries:
d2={'Name':'Python','id':10875,3:'Three'}
ser4=pd.Series(d2)
ser4

Name    Python
id       10875
3        Three
dtype: object

In [9]:
###using data stored in a dictionaries:
d2={'Name':'Python','id':10875,3:'Three'}
ser5=pd.Series(d2,index=['a','id','c'])
ser5

a       NaN
id    10875
c       NaN
dtype: object

In [10]:
d3={'Name':['A','B','C','D'],
   'Experience':[1.2,2.8,5.5,3.5],
   'Salary':[40000,55000,96000,60000]}
df0=pd.DataFrame(d3)
df0

  Name  Experience  Salary
0    A         1.2   40000
1    B         2.8   55000
2    C         5.5   96000
3    D         3.5   60000

In [11]:
d3={'Name':['A','B','C','D'],
   'Experience':[1.2,2.8,5.5,3.5],
   'Salary':[40000,55000,96000,60000]}
df0=pd.DataFrame(d3,index=[1,2,3,4])
df0

  Name  Experience  Salary
1    A         1.2   40000
2    B         2.8   55000
3    C         5.5   96000
4    D         3.5   60000

In [13]:
df0.iloc[2,1] ###iloc=index location.

5.5

In [14]:
###iloc is a function which we use to slice dataframes using the index position of the value we want to retrieve.

In [15]:
####loc function is used to slice dataframes with the row,column names(labels)

In [16]:
df0.at[3,'Experience']  #to get a single value from the dataframe

5.5

In [17]:
df0.loc[3,'Experience']

5.5

In [19]:
df0.loc[2:3]

  Name  Experience  Salary
2    B         2.8   55000
3    C         5.5   96000

In [20]:
df0.iloc[2:3]

  Name  Experience  Salary
3    C         5.5   96000

In [ ]:
#Q) access the column' column_name'})

In [ ]:
print(df7{'column','column2'[])
 0 Q)slice out all values greater than 10 of column1 and print out only another _column ', 'column_'name'

In [ ]:
 #Q)iterate over all rows in df4

In [ ]:
for i , j in df4.items()
0 false 
4 True
2 True 
name :0, dtype; object

In [1]:
###  check the data

In [2]:
data =pd.read_csv('salary_data.csv.)

SyntaxError: unterminated string literal (detected at line 1) (2770044158.py, line 1)

In [3]:
data.head()
data.taj1(10)
data.shape
import pandas as pd

NameError: name 'data' is not defined

In [ ]:
import pandas as pd
importg